{"pages":[{"title":"test","text":"","link":"/test/index.html"}],"posts":[{"title":"How to make money online?","text":"I have been working as a software engineer for more than 10 years. As I have a full-time job, it is not really a problem to make the money that is needed to support my family. But one day a question suddenly came into my mind. What if I lose my job and no one wants to hire me anymore? Can I make a living or even make a fortune with the skills and knowledge I have? So I started to do my research. After searching on Google and Youtube, I got a list of possible ways to make money using computer skills. Here are my list and my initial thought about each idea. I am going to further look into some of these ideas later. FreelancerObviously, the first problem (maybe the biggest one) is how to get your first client. I do not have any idea about that. CrowdsourcingThis is something new to me. Further investigation is needed. Self-mediaThe business model is simple. First, you have a web site, a blog or a Youtube channel. Then you have a lot of visitors. And finally, you can make money by advertisement or something like Amazon.com Associates. Yes, you are right. That’s why I start this blog. WritingYou can start with a blog and then you may write a book. Now there is some service online to make it possible for a person to publish a book by himself/herself. To build a niche app or pluginThis idea usually requires you to target a relatively small group of people that have specific requirements. As the market is too small for a regular business, an individual developer may take the chance. To take part in competitions and win rewardsIt can be an online competition like Kaggle or local Hackathons. Obviously, you need to be very good to win To provide online coursesIt appears to me that you need to be really good at something special. Because if you provide a course such as “Introduction to Python programming”, it is hard to stand out from hundreds of similar courses. e-commerceYou can sell something or some service. Here I heard of a new concept “drop shipping”, I need to look into it. Financial investmentSomeone say that programming skills can help you to gain profit in the traditional financial market. I do not believe it is that easy. Here is just the collection of all the ideas I got so far. I am going to try some of them and update my finds in my blog. Stay tuned!","link":"/2019/04/27/How-to-make-money-online/"},{"title":"Why Drop Shipping Does Not Work For Me","text":"Photo by Zan Ilic on Unsplash Drop shipping is a supply chain management method in which the retailer does not keep goods in stock but instead transfers the customer orders and shipment details to either the manufacturer, another retailer, or a wholesaler, who then ships the goods directly to the customer.(Wikipedia) In my last post, I listed several ways to make money online. I also mentioned that a new concept, drop shipping, came to my mind during my research. This week, I further looked into this business model. Unfortunately, although its advocators claim that it is a business model with low barriers to entry and can easily bring you thousands (if not millions) of dollars, my conclusion is that drop shipping is not a good idea for me. Here are my reasons. No Silver Bullet!!!In software engineering, “no silver bullet“ means there is no single technology that can ease software development. I believe it also applies to business. No single business model can make everyone rich! If drop shipping is really a method by which one can easily make a huge amount of money, everyone will start to do it until the business is no longer profitable. We shall bear in mind that anyone who tells you how successful he/she is in drop shipping may be affected by Survivorship Bias. Their success does not guarantee your success! It requires time and experienceBut don’t take me wrong. I still believe drop shipping is a good business model if you want to have a lean startup. But you can be successful only if you have the knowledge and experience required and you are willing to spend enough time and effort in it. As I understand, doing drop shipping is actually doing marketing and customer service. Neither of these two jobs is easy. They both require experience and time. What I am looking for is something that can accumulate my effort made in spare time. Obviously, a drop shipping business is not such a thing. You need to spend moneyThis may surprise drop shipping beginners. You really need to spend some money before you can make money from drop shipping. In theory, you can just spend $10 to get a cheap domain name and spend another $29 to have a Shopify store. Then you can list some goods from Aliexpress. Now you post something on Twitter/Facebook/Instagram to tell your friends that you have a fancy online store. If you are lucky enough, someone will place an order and you just start to make money. But in fact, no one will notice your online store. Actually, you would hope no one notices it because it is so ugly that it will become a joke among your friends. According to some drop a drop shipping expert, you need $500 - $1000 to build a decent online store. This is just a start. To get enough visitors to bring you sustainable profit, you need to continuously spend money (about $300) in marketing every month. Furthermore, you must be patient because you may not have any profit for the first 3-4 months even if you spend that much money. Just not for meIn conclusion, drop shipping is not a good part-time job or side project for me. The main reason is that I do not have the experience and I do not want to spend that much time and money in it. But I have to emphasize that drop shipping is a good business model for those who really take it seriously and want to start his/her own business.","link":"/2019/05/03/Why-Dropshipping-Does-Not-Work-For-Me/"}],"tags":[{"name":"business","slug":"business","link":"/tags/business/"}],"categories":[]}